export default {
  name: 'Егор',
  hello: 'Привет, это Егор',
  desc: 'Я Frontend-разработчик с навыками в UX/UI дизайне и c обширным опытом в веб-разработке.',

  dark: 'Темно',
  light: 'Светло',

  specFront: 'Frontend разработчик',
  specDesign: 'UX/UI дизайнер',

  home: 'Главная',
  skills: 'Навыки',
  experience: 'Опыт',
  portfolio: 'Портфолио',
  uilib: 'UI Lib',
  articles: 'Статьи',
  contacts: 'Контакты',

  humidity: 'Влажность',
  pressure: 'Давление',
  windSpeed: 'Скорость ветра',
  cloudiness: 'Облачность',
  hPa: 'гПа',
  ms: 'м/c',

  loading: 'Загрузка',

  showMore: 'Показать полностью',
  hide: 'Свернуть',

  skillsContent:
    'Знать все на свете невозможно, однако современный Frontend-разработчик должен оставаться гибким, способным усваивать новые технологии. Сегодня, когда веб разработка стремится к универсальности во всем, быстрое погружение и применение мощных инструментов становится не самой сложной задачей.',
  skillsCross: 'Кроссбраузерная и адаптивная верстка',
  skillsOOP: 'ООП',
  skillsDesignHeader: 'Дизайн и UI/UX',
  skillsDesign:
    'Photoshop, Figma, Illustrator, Прототипирование, Wireframing, User Research, Принципы UX\\UI, Эргономика адаптивного веб интерфейса',
  skillsAnotherHeader: 'Другие навыки',
  skillsAnother:
    'БЭМ, Основы SEO, Теория дизайна, История искусств, Айдентика, Теория цвета, Фотография, Цветокоррекция, Ретушь, Слепой метод печати, IntelliJ IDEA, Vim',

  expContent:
    'Мой общий опыт веб-разработки свыше 8 лет. Интерес к программированию, и к вебу в частности, возник еще в школьные годы.',
  expOsHeader: 'Образовательная онлайн-платформа «Открытая школа»',
  expOsContent:
    'Frontend разработчик. Поддержка существующей версии платформы. Разработка новой версии платформы, полный редизайн. Адаптивная верстках сложных Vue компонентов, работа с данными, API. Прототипирование новых страниц, разработка дизайна в рамках новой дизайн системы платформы. Одним из наиболее интересных моментов для меня было разработка видео и аудио плеера, текстового редактора, календарей и сложных таблиц для работы с данными.',
  expFreeHeader: 'Частная практика',
  expFreeContent:
    'Верстка адаптивных сайтов различной сложности. Разработка сайтов под CMS WordPress и Bitrix. В общей сложности я разработал более 60 сайтов за чуть более чем 5 лет. Сотрудничал в основном с частными клиентами, но так же среди клиентов были веб-студии и частные компании.',
  expAdd:
    'Часть моего опыта была получена в процессе разработки веб-приложений, движимой не коммерческими интересами, а любопытством. Особое удовлетворение для меня — осознание, что мне удалось создать программное решение, которое ранее казалось сложным.',

  frontAndBack: 'Frontend и Backend',
  design: 'Дизайн',

  m1: 'Маркетплейс',
  m2: 'Eagles MMA Moscow - Клуб смешанных единоборств',
  m3: 'Сеть зоомагазинов',
  m4: 'Доставка еды',
  m5: 'Интернет магазин',
  m6: 'Онлайн кинотеатр',

  notFound: 'Страница не найдена',
  notFoundText:
    'Кажется, такой страницы нет. Возможно, она была перемещена, удалена или просто никогда не существовала.',
};
